{
    "data": [
        {
            "index": 1,
            "joke": "Why did the duck go to the doctor? Because it was feeling a little 'fowl'!"
        },
        {
            "index": 2,
            "joke": "What do you get when you cross a duck with fireworks? Firequackers!"
        },
        {
            "index": 3,
            "joke": "What did the duck say when it won the lottery? 'Waddle I do with all this money?'"
        },
        {
            "index": 4,
            "joke": "Why did the duck refuse to fly south for the winter? Because it couldn't find a 'quacking' good reason!"
        },
        {
            "index": 5,
            "joke": "How do ducks communicate during basketball games? They 'quack' the code!"
        },
        {
            "index": 6,
            "joke": "What did one duck say to the other when they bumped into each other? 'Sorry, I didn't mean to 'quack' into you!'"
        },
        {
            "index": 7,
            "joke": "Why did the duck go to space? To quack the mysteries of the universe!"
        },
        {
            "index": 8,
            "joke": "What's a duck's favorite game? Duck Duck Goose, of course!"
        },
        {
            "index": 9,
            "joke": "Why don't ducks ever get lost? Because they always know their 'quack' position!"
        },
        {
            "index": 10,
            "joke": "How did the duck make friends? It was very 'down' to earth!"
        },
        {
            "index": 11,
            "joke": "What do you call a duck that's a magician? A 'quack' conjurer!"
        },
        {
            "index": 12,
            "joke": "Why did the duck bring a rose to the party? Because it wanted to 'quack' the ice!"
        },
        {
            "index": 13,
            "joke": "What do you call a duck that loves to dance? A quackstep!"
        },
        {
            "index": 14,
            "joke": "Why was the duck put into the army? Because it was an expert at 'duck and cover'!"
        },
        {
            "index": 15,
            "joke": "What do you call a duck that's addicted to drugs? A 'quack' head!"
        },
        {
            "index": 16,
            "joke": "Why did the duck become a comedian? Because its jokes always 'quack' everyone up!"
        },
        {
            "index": 17,
            "joke": "What's a duck's favorite food? Quackers and cheese!"
        },
        {
            "index": 18,
            "joke": "Why did the duck become a detective? To quack the case!"
        },
        {
            "index": 19,
            "joke": "What did the duck say to the comedian? 'You quack me up!'"
        },
        {
            "index": 20,
            "joke": "How do you know if a duck is in your refrigerator? You can hear the 'quack'!"
        }
    ]
}
